app/Controllers/CustomerAuthController.php

    public function loginMobile()
    {
        try{
            $validation = \Config\Services::validation();
            $check = $this->validate([
                'mobile' => [
                'rules'	=> ['required','min_length[13]','max_length[13]'],
            ],
            ]);
            if (!$check) {  // validation errors occurs
                return $this->respondCreated(['status' => false, 'message' => 'Validation errors occurs..!','data' => [],'errors' => $this->validator->getErrors()]);
            }

            $roleModel = new Roles();
            $roleModel->select('id');
            $role_id = $roleModel->like('name','customer','both')->first();
---
SELECT `id`
FROM `roles`
WHERE `name` LIKE '%customer%' ESCAPE '!'
 LIMIT 1