app/Controllers/DriverAuthController.php

SELECT `id`
FROM `roles`
WHERE `name` LIKE '%driver%' ESCAPE '!'
 LIMIT 1
---
    public function loginMobile()
    {
        try{
        $validation = \Config\Services::validation();
        $check = $this->validate([
            'mobile' => [
                'rules'	=> ['required','min_length[13]','max_length[13]'],
           ],
        ]);
        if (!$check) {  // validation errors occurs
            return $this->respondCreated(['status' => false, 'message' => 'Validation errors occurs..!','data' => [],'errors' => $this->validator->getErrors()]);
        }
        // get role id
        $roleModel = new Roles();
        $roleModel->select('id');
        $role_id = $roleModel->like('name','driver','both')->first();