app/Controllers/PageController.php

SELECT `id`, `key`, `value`
FROM `settings`
WHERE `key` = 'page_about'
---
    public function page($key)
    {
        try{
            $page = new Setting();
            $page = $page->select('id,key,value')->where('key',$key)->get()->getResult();